package com.kh.first; // 패키지 선언부 : 현재 클래스의 위치

	/*
	 * 주석(Comments)
	 * 
	 * 주석은 프로그램을 실행하는데 있어 아무런 영향을 끼치지 않음!
	 * 코드를 작성한 후 작성한 코드를 쉽게 이해하기 위함!
	 * 우리는 학습의 용도로 주석을 사용할 예정
	 */

	/*
	 * 패키지(Package)
	 * 
	 * 소스코드를 작성할 때, 클래스라는 파일을 만들어서 작업을 해야함!!
	 * 모든 클래스를 같은 패키지에 넣고 작업하면 관리가 힘듦
	 * 각각의 클래스들을 용도에 맞게 구분하여 패키지에 보관하는것을 권장
	 * 
	 * 하나의 패키지 안에 여러 개의 클래스들이 존재할 수 있음 -> 동일한 이름의 클래스는 존재할 수 없음
	 * 
	 * 권장사항
	 * 
	 * 기본적으로 세 단계 이상으로 만들어줄 것
	 * 
	 * com.(회사이름).(프로젝트이름/팀이름/카테고리이름/도메인이름)
	 * 
	 */
public class HelloWorld { // 클래스명은 HelloWorld라고 지었음 { Scope / Block }
	// Scope(Block)  {   }는 중괄호의 여는 부분부터 닫는 부분까지를 의미하며, 복합문을 구성하는 요소
	// 종속된 문장이 여러 줄 일때 반드시 '{'로 시작하고 '}'로 닫습니다
	
	// main method : 프로그램의 시작점(Entry point), 프로그램당 1개는 있어야함
	public static void main(String[] args) {
		// * Method : 하나의 기능 단위
		// 하나의 클래스 안에 여러 개의 메소드가 존재할 수 있음
		// 메소드 스코프안의 구문을 수행하고 싶다면 반드시 "호출"해야 한다!
		myFirstMethod();
		System.out.print("스타트"); // 출력을 할 때 사용하는 기능
		myFirstMethod();
	}    
	
	public static void myFirstMethod() {
		// 안녕하세요. 제 이름은 XXX입니다. 반갑습니다~
		System.out.print("안녕하세요. 제 이름은 홍길동입니다. 반갑습니다~"); 
		// 논리적인 한 문장이 끝날 때 반드시 세미콜론을 붙임!!!
	}
	/*
	 * 공백문자 빈 칸, 탭 문자, 빈 줄 등이 있으며 이런 친구들을 소스코드를 보기 좋게
	 * 하고 알아보기 쉽게 만드는데 사용됨
	 */
	
}











